{
  "articles": [
    {
      "id": "welcome-to-emenent-times",
      "featured": true,
      "title": "Welcome to The Emenent Times",
      "meta": "<span>By Panda and Catto</span><span>Aug 23, 2025</span><span>5 min read</span>",
      "image": "images/image.jpg",
      "excerpt": "Welcome to The Emenent Times—your new go-to spot for everything from lifesaving study resources to blog posts that perfectly capture the chaos of surviving this degree.",
      "date": "August 23, 2025",
      "body": "<p>Greetings, fellow sleep-deprived problem-solvers 👋\n\nWelcome to The Emenent Times — a site made by engineers, for engineers, and probably debugged at 2 AM with the help of coffee, Google, and sheer emotional damage.\n\nHere’s what you’ll find here:\n\n- Drive links loaded with study resources – Because when the exam is tomorrow and you’ve only attended class 'in spirit,' you’ll thank us.\n- Blog posts – Part survival guide, part therapy session, part rant about why MATLAB thinks it’s funny.\n- Resources that actually work – Unlike that one lab equipment that mysteriously stops working the minute the TA looks away.\n\nWe’re not here to preach productivity or sell you a course on '10 ways to study smarter.' Nah. We know the truth: engineers learn best when panic and deadlines form a perfect resonance frequency.\n\nThink of The Emenent Times as your friendly neighborhood knowledge cache. A place where procrastination feels slightly less like doom and slightly more like teamwork.\n\nSo, bookmark us, share us, and remember:\nIf engineering has taught us anything, it’s that nothing works the first time… except our drive links. 🚀\n\nWelcome aboard. Let’s engineer survival together.</p>"
    },
    {
      "id": "welcome-freshies",
      "featured": false,
      "title": "Welcome to Hell 47",
      "meta": "<span>By Panda</span><span>Aug 23, 2025</span><span>4 min read</span>",
      "image": "https://drive.google.com/drive/folders/1WP-zIreHIoRqz3_Ku2d9rDs9GWyhF8DX",
      "excerpt": "You’ve made it into CEME — the place where dreams are built, sleep is optional, and MATLAB becomes your toxic relationship. First things first: welcome to The Emenent Times, your soon-to-be best friend when classes, labs, and deadlines come at you faster than attendance warnings.",
      "date": "March 15, 2025",
      "body": "<p>Congratulations, freshies 🎉 You’ve made it into CEME — the place where dreams are built, sleep is optional, and MATLAB becomes your toxic relationship.\n\nFirst things first: welcome to The Emenent Times, your soon-to-be best friend when classes, labs, and deadlines come at you faster than attendance warnings.\n\nHere’s what you should know:\n\n- Seniors are your Google 2.0 – We’ve already suffered, and we’ve left behind drive links, notes, and blog posts to help you survive.\n- Group study = group panic – It always starts with 'let’s study together' and ends with memes and chai.\n- CEME life – You’ll laugh, you’ll cry, you’ll question why an assignment has more pages than your birth certificate. But trust us, it’s worth it.\n\nThis site exists to make your life *slightly* easier: all the notes you’ll need, study resources, and the occasional blog post reminding you that you’re not alone in this academic rollercoaster.\n\nSo buckle up, freshies. The labs may fry your brain (and sometimes the actual circuit), but you’ll find your people, your rhythm, and eventually — your degree.\n\nWelcome to the chaos. Welcome to CEME.\nAnd most importantly, welcome to The Emenent Times 🚀</p>"
    }
  ]
}