{
  "articles": [
    {
      "id": "welcome-to-emenent-times",
      "featured": false,
      "title": "Welcome to The Emenent Times",
      "meta": "<span>By Anon</span><span>Aug 23, 2025</span><span>5 min read</span>",
      "image": "images/freshies1.jpg",
      "excerpt": "Welcome to The Emenent Times—your new go-to spot for everything from lifesaving study resources to blog posts that perfectly capture the chaos of surviving this degree.",
      "date": "August 23, 2025",
      "body": "<h1>Hey there,</h1>\n<p>Welcome to <span class=\"highlight\">The Emenent Times</span> – a site made by emenents for emenents.</p>\n<p>Iss semester mein shuru se parhna hai? Academic comeback karna hai? Well, you’ve come to the right place. The Emenent Times isn’t just another website; it’s a complete survival guide to keep you sane during the semester.</p>\n<h2>Here’s what you’ll find here:</h2>\n<ul>\n<li><span class=\"highlight\">Drive links loaded with study resources</span> – Because when the exam is tomorrow and you’ve only attended class 'in spirit,' you’ll thank us.</li>\n<li><span class=\"highlight\">Blog posts</span> – Part survival guide, part therapy session, part rant about why MATLAB thinks it’s funny.</li>\n<li><span class=\"highlight\">Anonymous Rants</span> – Because no one should have to be alone. One small request though, keep the requests respectful or they won’t make it onto the site.</li>\n</ul>\n<p>We aim to make this site a one-stop spot for surviving engineering life—tips for last-minute assignments, lab hacks, and resources that actually help. If you see something missing or have a cool idea to contribute, send it over! You can submit blog posts, share resources, or give us feedback and suggestions. The more you participate, the better this place gets for everyone.\n\nSo grab your chai, coffee, or energy drink, take a deep breath, and dive in! Remember, engineering may test your patience, your sanity, and occasionally your will to live—but here at The Emenent Times, you’re never doing it alone. Contribute, explore, laugh, and rant… and together, we’ll survive this glorious chaos, one assignment at a time.</p>"
    },
    {
      "id": "welcome-freshies",
      "featured": false,
      "title": "Welcome to Hell 47",
      "meta": "<span>By Anon</span><span>Aug 23, 2025</span><span>4 min read</span>",
      "image": "images/image.jpg",
      "excerpt": "Congratulations freshies you made it to university. Here's everything you need to know to survive.",
      "date": "August 23, 2025",
      "body":  "<h1>Congratulations, freshies!</h1>\n<p>You’ve made it into CEME (even if you didn’t want to). First things first: welcome to <span class=\"highlight\">The Emenent Times</span>, your soon-to-be best friend when classes, labs, and deadlines come at you faster than attendance warnings.</p>\n<h2>Here’s what you should know:</h2>\n<ul>\n<li><span class=\"highlight\">Seniors are your ChatGPT</span> – We’ve already suffered, and we’ve left behind drive links, notes, and blog posts to help you survive.</li>\n<li><span class=\"highlight\">Bistro</span> has the best Paratha, <span class=\"highlight\">Fresh</span> has the best Mango Shake, Pasta, Cheesesteak Burger, <span class=\"highlight\">VC</span> has the best chai and hot chocolate, and <span class=\"highlight\">Crusty’s</span> has the best (only) Pizza.</li>\n<li><span class=\"highlight\">The ATM near the girls hostel</span> is the most likely to be working.</li>\n<li>The people you meet in the first semester aren’t your best friends—be careful who you confide in (we’re here to be your friends).</li>\n<li>Don’t make enemies—people can make your life hell.</li>\n</ul>\n<p>Welcome to EME life, kiddos, where you’ll laugh, you’ll cry, you’ll question why an assignment has more pages than your birth certificate. But you’ll also grow, learn, and make loads of memories, so it’s worth it. This site exists to make your life <em>slightly</em> easier: all the notes you’ll need, study resources, and the occasional blog post reminding you that you’re not alone in this academic rollercoaster.</p>\n<p>So buckle up, freshies. The labs may fry your brain (and sometimes the actual circuit), but you’ll find your people, your rhythm, and eventually — your degree. Welcome to the chaos. Welcome to CEME. And most importantly, welcome to <span class=\"highlight\">The Emenent Times</span>.</p>"
    },
    {
  "id": "qawali-night-2025",
  "featured": false,
  "title": "Qawali Night at EME",
  "meta": "<span>By Gossip Girl</span><span>Sep 27, 2025</span><span>5 min read</span>",
  "image": "images/qawali-night.jpg",
  "excerpt": "Hey Emenents! EME’s Qawali Night was beautifully organized, full of charm, and sprinkled with just enough drama to keep everyone talking.",
  "date": "September 27, 2025",
  "body": "<p>Hey Emenents,</p>\n\n<p>Every now and then, EME pulls off an event that reminds us just how good campus life can be — and last night’s Qawali was definitely one of those moments. From the get-go, it was clear that the organizers had worked hard to put together something special. The stage was set beautifully, the arrangements were smooth, and the whole atmosphere gave off that perfect “mehfil” vibe. Credit where it’s due — the planning and execution were nothing short of impressive.</p>\n\n<p>For the most part, the evening lived up to expectations. The audience settled in, the rhythm set the mood, and it felt like one of those rare nights where tradition and campus life blend effortlessly. Of course, every event has its quirks, and a few lively moments added extra excitement — just enough to make the night playful and memorable without overshadowing the overall vibe.</p>\n\n<p>It wasn’t malicious, of course — just the kind of over-eager spirit that sometimes makes things a little unpredictable. Even so, the night carried the right mix of culture, community, and campus charm — the kind of memory that lingers long after the music fades.</p>\n\n<p>All in all, Qawali Night was exactly what it was meant to be: a celebration. The organizers gave us a well-thought-out, beautifully executed evening, and in true EME fashion, it was classy, energetic, and just a little unpredictable — the kind of story we’ll laugh about later while still remembering the elegance at its core.</p>\n\n<p>XOXO - Gossip Girl</p>"
}
  ]
}