{
  "articles": [
    {
      "id": "welcome-to-emenent-times",
      "featured": true,
      "title": "Welcome to The Emenent Times",
      "meta": "<span>By Anon</span><span>Aug 23, 2025</span><span>5 min read</span>",
      "image": "images/image.jpg",
      "excerpt": "Welcome to The Emenent Times—your new go-to spot for everything from lifesaving study resources to blog posts that perfectly capture the chaos of surviving this degree.",
      "date": "August 23, 2025",
      "body": "<h1>Hey there,</h1>\n<p>Welcome to <span class=\"highlight\">The Emenent Times</span> – a site made by emenents for emenents.</p>\n<p>Iss semester mein shuru se parhna hai? Academic comeback karna hai? Well, you’ve come to the right place. The Emenent Times isn’t just another website; it’s a complete survival guide to keep you sane during the semester.</p>\n<h2>Here’s what you’ll find here:</h2>\n<ul>\n<li><span class=\"highlight\">Drive links loaded with study resources</span> – Because when the exam is tomorrow and you’ve only attended class 'in spirit,' you’ll thank us.</li>\n<li><span class=\"highlight\">Blog posts</span> – Part survival guide, part therapy session, part rant about why MATLAB thinks it’s funny.</li>\n<li><span class=\"highlight\">Anonymous Rants</span> – Because no one should have to be alone. One small request though, keep the requests respectful or they won’t make it onto the site.</li>\n</ul>\n<p>We aim to make this site a one-stop spot for surviving engineering life—tips for last-minute assignments, lab hacks, and resources that actually help. If you see something missing or have a cool idea to contribute, send it over! You can submit blog posts, share resources, or give us feedback and suggestions. The more you participate, the better this place gets for everyone.</p>"
    },
    {
      "id": "welcome-freshies",
      "featured": false,
      "title": "Welcome to Hell 47",
      "meta": "<span>By Panda</span><span>Aug 23, 2025</span><span>4 min read</span>",
      "image": "https://drive.google.com/drive/folders/1WP-zIreHIoRqz3_Ku2d9rDs9GWyhF8DX",
      "excerpt": "You’ve made it into CEME — the place where dreams are built, sleep is optional, and MATLAB becomes your toxic relationship. First things first: welcome to The Emenent Times, your soon-to-be best friend when classes, labs, and deadlines come at you faster than attendance warnings.",
      "date": "March 15, 2025",
      "body": "<p>Congratulations, freshies 🎉 You’ve made it into CEME — the place where dreams are built, sleep is optional, and MATLAB becomes your toxic relationship.\n\nFirst things first: welcome to The Emenent Times, your soon-to-be best friend when classes, labs, and deadlines come at you faster than attendance warnings.\n\nHere’s what you should know:\n\n- Seniors are your Google 2.0 – We’ve already suffered, and we’ve left behind drive links, notes, and blog posts to help you survive.\n- Group study = group panic – It always starts with 'let’s study together' and ends with memes and chai.\n- CEME life – You’ll laugh, you’ll cry, you’ll question why an assignment has more pages than your birth certificate. But trust us, it’s worth it.\n\nThis site exists to make your life *slightly* easier: all the notes you’ll need, study resources, and the occasional blog post reminding you that you’re not alone in this academic rollercoaster.\n\nSo buckle up, freshies. The labs may fry your brain (and sometimes the actual circuit), but you’ll find your people, your rhythm, and eventually — your degree.\n\nWelcome to the chaos. Welcome to CEME.\nAnd most importantly, welcome to The Emenent Times 🚀</p>"
    }
  ]
}